let i = 0;
while (i < 3) { // выводит 0, затем 1, затем 2
  alert( i );
  i++;
}
//////////////////////////////////////////////////////////////
let i = 3;
while (i) { // когда i будет равно 0, условие станет ложным,
    //  и цикл остановится
  alert( i );
  i--;
}
//////////////////////////////////////////////////////////////
do {
    // тело цикла
  } while (condition);
//////////////////////////////////////////////////////////////
  let i = 0;
do {
  alert( i );
  i++;
} while (i < 3);
//////////////////////////////////////////////////////////////
for (let i = 0; i < 3; i++) { // выведет 0, затем 1, затем 2
    alert(i);
  }
//////////////////////////////////////////////////////////////
  // for (let i = 0; i < 3; i++) alert(i)

// Выполнить начало
let i = 0;
// Если условие == true → Выполнить тело, Выполнить шаг
if (i < 3) { alert(i); i++ }
// Если условие == true → Выполнить тело, Выполнить шаг
if (i < 3) { alert(i); i++ }
// Если условие == true → Выполнить тело, Выполнить шаг
if (i < 3) { alert(i); i++ }
// ...конец, потому что теперь i == 3

//////////////////////////////////////////////////////////////

let sum = 0;

while (true) {
  let value = +prompt("Введите число", '');
  if (!value) break; // (*)
  sum += value;
}
alert( 'Сумма: ' + sum );

// Будет запрашивать числа, пока рамка не будет пуста
